# Duplicates

Exploring the repeating records with in the dataset.

In [8]:
import pandas as pd

In [9]:
df = pd.read_csv("../.warn-transformer/processed/consolidated.csv")

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40082 entries, 0 to 40081
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   jobs         35323 non-null  float64
 1   date         35794 non-null  object
 2   postal_code  40082 non-null  object
 3   location     35877 non-null  object
 4   hash_id      40082 non-null  object
 5   company      40079 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.8+ MB

In [11]:
df.head()

,jobs,date,postal_code,location,hash_id,company
0,40.0,2021-09-16,AK,Anchorage,b855422a87ece9da20ec6571e2f8f6f48521d4e06610e5...,Bean’s Cafe
1,134.0,2021-07-02,AK,Prudhoe Bay,2214cbc57e63037a436152aeb018819a5e8777e2e8eab1...,Kakivik Asset Mgmt
2,185.0,2021-04-30,AK,"Fairbanks, North Pole",20c76d62449eb697b6f95288b8982e36586afd99fc7b7c...,First Student
3,59.0,2021-04-12,AK,Anchorage,0ca0a89d9a684741de7f5199ef69ffc948b5df7e93e22c...,GCI Communication Group
4,NaN,2020-09-30,AK,"Anchorage and 20 smaller Alaska communities, p...",b7c5bb7e614fcce37f1f8c7ba00786faa5482270039b5c...,"RavnAir Group, Corvus Airlines, Hageland Aviat..."

In [12]:
dupes_df = df[df.duplicated()]

In [13]:
dupes_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 176 entries, 367 to 30620
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   jobs         175 non-null    float64
 1   date         59 non-null     object
 2   postal_code  176 non-null    object
 3   location     176 non-null    object
 4   hash_id      176 non-null    object
 5   company      176 non-null    object
dtypes: float64(1), object(5)
memory usage: 9.6+ KB

In [14]:
dupes_df.sort_values("hash_id").head()

,jobs,date,postal_code,location,hash_id,company
21366,332.0,NaN,MO,Mexico,001f1fd9ad1edbca416fb47e84f51387a0161d9561a1f8...,Spartan Light Metal Products - Mexico
21430,84.0,NaN,MO,Kansas City,00615e29c56ff4a46a1c0de9fcd7a023b60e3141a1c800...,Enterprise Holdings - National and Alamo Rent ...
20642,NaN,2012-12-27,MD,"7603 Energy Parkway, Baltimore, MD",01a93ea1aa834f89e8af754db49ef52822fa73e5c86be2...,Commerce Corporation
21381,14.0,NaN,MO,Monett (7) & Joplin (7),0247d1bfa9256b763989545228578abea24368747e457d...,Justin Retail
23377,224.0,2022-03-20,NJ,Jersey City,035c1c8c3ecf3d8fc7078b674507a9c586b9839a3fc892...,NY Daily News -Liberty View Production Facility

In [15]:
dupes_df.groupby("postal_code").size().rename("total").reset_index()

   postal_code  total
0           AL      1
1           CA     31
2           CO     10
3           FL      1
4           GA      1
5           IA      1
6           IN      1
7           MD      1
8           MO    106
9           NE      4
10          NJ     15
11          OR      1
12          TX      3